In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  7  5  8  8
1  3  1  2  8  3
2  3  1  3  9  2
3  4  5  8  9  3
4  6  7  9  3  4

In [3]:

df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  8  5  1  8  7
1  8  2  3  3  1
2  9  3  3  2  1
3  9  8  4  3  5
4  3  9  6  4  7

In [4]:
df

   A  B  C  D  E
0  1  7  5  8  8
1  3  1  2  8  3
2  3  1  3  9  2
3  4  5  8  9  3
4  6  7  9  3  4

In [5]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  8  5  1  8  7
1  8  2  3  3  1
2  9  3  3  2  1
3  9  8  4  3  5
4  3  9  6  4  7